zhiyix/jlydemo/Code/Libraries/GSFLibraries/STM32F10x_GSFGLibC/inc/stm32glibc_rcc.h
/******************** (C)Copyright zjuee.cn ************************************
* File Name          : stm32glibc_rcc.h
* Author             : Zhiyix(Wang)
* Version            : V1.0.0
* Create Date        : 2014-11-04
* Last Update        : 2014-11-04
* Description        : RCC firmware library (for IAR C++).
********************************************************************************/
#ifndef __STM32GLIBC_RCC_H
#define __STM32GLIBC_RCC_H

#include "stm32glibc_type.h"


#if (false)
/* Exported constants --------------------------------------------------------*/
/* GPIO pins define ----------------------------------------------------------*/
//!
//! @{
#define RCC_AHBPeriph_DMA1        		((uint32_t)0x00000001)
#define RCC_AHBPeriph_DMA2            	((uint32_t)0x00000002)
#define RCC_AHBPeriph_SRAM           	((uint32_t)0x00000004)
#define RCC_AHBPeriph_FLITF          	((uint32_t)0x00000010)
#define RCC_AHBPeriph_CRC            	((uint32_t)0x00000040)

#ifndef STM32F10X_CL
#define RCC_AHBPeriph_FSMC          	((uint32_t)0x00000100)
#define RCC_AHBPeriph_SDIO          	((uint32_t)0x00000400)
#else
#define RCC_AHBPeriph_OTG_FS         	((uint32_t)0x00001000)
#define RCC_AHBPeriph_ETH_MAC        	((uint32_t)0x00004000)
#define RCC_AHBPeriph_ETH_MAC_Tx    	((uint32_t)0x00008000)
#define RCC_AHBPeriph_ETH_MAC_Rx     	((uint32_t)0x00010000)
#endif /* STM32F10X_CL */
//! @}
//!
//! @{
#define RCC_APB2Periph_AFIO             ((uint32_t)0x00000001)
#define RCC_APB2Periph_GPIOA            ((uint32_t)0x00000004)
#define RCC_APB2Periph_GPIOB            ((uint32_t)0x00000008)
#define RCC_APB2Periph_GPIOC            ((uint32_t)0x00000010)
#define RCC_APB2Periph_GPIOD            ((uint32_t)0x00000020)
#define RCC_APB2Periph_GPIOE            ((uint32_t)0x00000040)
#define RCC_APB2Periph_GPIOF            ((uint32_t)0x00000080)
#define RCC_APB2Periph_GPIOG            ((uint32_t)0x00000100)
#define RCC_APB2Periph_ADC1             ((uint32_t)0x00000200)
#define RCC_APB2Periph_ADC2             ((uint32_t)0x00000400)
#define RCC_APB2Periph_TIM1             ((uint32_t)0x00000800)
#define RCC_APB2Periph_SPI1             ((uint32_t)0x00001000)
#define RCC_APB2Periph_TIM8             ((uint32_t)0x00002000)
#define RCC_APB2Periph_USART1           ((uint32_t)0x00004000)
#define RCC_APB2Periph_ADC3             ((uint32_t)0x00008000)
#define RCC_APB2Periph_TIM15            ((uint32_t)0x00010000)
#define RCC_APB2Periph_TIM16            ((uint32_t)0x00020000)
#define RCC_APB2Periph_TIM17            ((uint32_t)0x00040000)
#define RCC_APB2Periph_TIM9             ((uint32_t)0x00080000)
#define RCC_APB2Periph_TIM10            ((uint32_t)0x00100000)
#define RCC_APB2Periph_TIM11            ((uint32_t)0x00200000)
//! @}
//!
//! @{
#define RCC_APB1Periph_TIM2             ((uint32_t)0x00000001)
#define RCC_APB1Periph_TIM3             ((uint32_t)0x00000002)
#define RCC_APB1Periph_TIM4             ((uint32_t)0x00000004)
#define RCC_APB1Periph_TIM5             ((uint32_t)0x00000008)
#define RCC_APB1Periph_TIM6             ((uint32_t)0x00000010)
#define RCC_APB1Periph_TIM7             ((uint32_t)0x00000020)
#define RCC_APB1Periph_TIM12            ((uint32_t)0x00000040)
#define RCC_APB1Periph_TIM13            ((uint32_t)0x00000080)
#define RCC_APB1Periph_TIM14            ((uint32_t)0x00000100)
#define RCC_APB1Periph_WWDG             ((uint32_t)0x00000800)
#define RCC_APB1Periph_SPI2             ((uint32_t)0x00004000)
#define RCC_APB1Periph_SPI3             ((uint32_t)0x00008000)
#define RCC_APB1Periph_USART2           ((uint32_t)0x00020000)
#define RCC_APB1Periph_USART3           ((uint32_t)0x00040000)
#define RCC_APB1Periph_UART4            ((uint32_t)0x00080000)
#define RCC_APB1Periph_UART5            ((uint32_t)0x00100000)
#define RCC_APB1Periph_I2C1             ((uint32_t)0x00200000)
#define RCC_APB1Periph_I2C2             ((uint32_t)0x00400000)
#define RCC_APB1Periph_USB              ((uint32_t)0x00800000)
#define RCC_APB1Periph_CAN1             ((uint32_t)0x02000000)
#define RCC_APB1Periph_CAN2             ((uint32_t)0x04000000)
#define RCC_APB1Periph_BKP              ((uint32_t)0x08000000)
#define RCC_APB1Periph_PWR              ((uint32_t)0x10000000)
#define RCC_APB1Periph_DAC              ((uint32_t)0x20000000)
#define RCC_APB1Periph_CEC              ((uint32_t)0x40000000)
//! @}

/**
 * @brief In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.
  */
#if !defined  HSE_VALUE
#ifdef STM32F10X_CL
#define HSE_VALUE    ((uint32_t)25000000) /*!< Value of the External oscillator in Hz */
#else
#define HSE_VALUE    ((uint32_t)8000000) /*!< Value of the External oscillator in Hz */
#endif /* STM32F10X_CL */
#endif /* HSE_VALUE */


/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value
   */
#define HSE_STARTUP_TIMEOUT   ((uint16_t)0x0500) /*!< Time out for HSE start up */

#define HSI_VALUE    ((uint32_t)8000000) /*!< Value of the Internal oscillator in Hz*/
#endif

namespace periph_c
{

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! 时钟控制寄存器(RCC_CR)
    struct RCC_CR_Struct
    {
        volatile uint32_t HSION                         : 1; //Bit0
        volatile uint32_t HSIRDY                        : 1; //Bit1
        volatile uint32_t Resv1                         : 1; //Bit2
        volatile uint32_t HSITRIM                       : 5; //Bit3 ~ Bit7
        volatile uint32_t HSICAL                        : 8; //Bit8 ~ Bit15
        volatile uint32_t HSEON                         : 1; //Bit16
        volatile uint32_t HSERDY                        : 1; //Bit17
        volatile uint32_t HSEBYP                        : 1; //Bit18
        volatile uint32_t CSSON                         : 1; //Bit19
        volatile uint32_t Resv2                         : 4; //Bit20 ~ Bit23
        volatile uint32_t PLLON                         : 1; //Bit24
        volatile uint32_t PLLRDY                        : 1; //Bit25
        volatile uint32_t PLL2ON                        : 1; //Bit26
        volatile uint32_t PLL2RDY                       : 1; //Bit27
        volatile uint32_t PLL3ON                        : 1; //Bit28
        volatile uint32_t PLL3RDY                       : 1; //Bit29
        volatile uint32_t Resv3                         : 2; //Bit30 ~ Bit31
    };

    typedef struct RCC_CR_Struct RCC_CR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! 时钟控制寄存器(RCC_CFGR)
    struct RCC_CFGR_Struct
    {
        volatile uint32_t SW                            : 2; //Bit0 ~ Bit1
        volatile uint32_t SWS                           : 2; //Bit2 ~ Bit3
        volatile uint32_t HPRE                          : 4; //Bit4 ~ Bit7
        volatile uint32_t HPRE1                         : 3; //Bit8 ~ Bit10
        volatile uint32_t HPRE2                         : 3; //Bit11 ~ Bit13
        volatile uint32_t ADCPRE                        : 2; //Bit14 ~ Bit15
        volatile uint32_t PLLSRC                        : 1; //Bit16
        volatile uint32_t PLLXTPRE                      : 1; //Bit17
        volatile uint32_t PLLMUL                        : 4; //Bit18 ~ Bit21
        volatile uint32_t OTGFSPRE                      : 1; //Bit22
        volatile uint32_t Resv1                         : 1; //Bit23
        volatile uint32_t MCO                           : 4; //Bit24 ~ Bit27
        volatile uint32_t Resv2                         : 4; //Bit28 ~ Bit31
    };

