zhiyix/jlydemo/Code/Libraries/GSFLibraries/STM32F10x_GSFGLibC/inc/stm32glibc_rcc.h
    typedef struct RCC_CFGR_Struct RCC_CFGR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! 时钟中断寄存器(RCC_CIR)
    struct RCC_CIR_Struct
    {
        volatile uint32_t LSIRDYF                       : 1; //Bit0
        volatile uint32_t LSERDYF                       : 1; //Bit1
        volatile uint32_t HSIRDYF                       : 1; //Bit2
        volatile uint32_t HSERDYF                       : 1; //Bit3
        volatile uint32_t PLLRDYF                       : 1; //Bit4
        volatile uint32_t PLL2RDYF                      : 1; //Bit5
        volatile uint32_t PLL3RDYF                      : 1; //Bit6
        volatile uint32_t CSSF                          : 1; //Bit7
        volatile uint32_t LSIRDYIE                      : 1; //Bit8
        volatile uint32_t LSERDYIE                      : 1; //Bit9
        volatile uint32_t HSIRDYIE                      : 1; //Bit10
        volatile uint32_t HSERDYIE                      : 1; //Bit11
        volatile uint32_t PLLRDYIE                      : 1; //Bit12
        volatile uint32_t PLL2RDYIE                     : 1; //Bit13
        volatile uint32_t PLL3RDYIE                     : 1; //Bit14
        volatile uint32_t Resv1                         : 1; //Bit15
        volatile uint32_t LSIRDYC                       : 1; //Bit16
        volatile uint32_t LSERDYC                       : 1; //Bit17
        volatile uint32_t HSIRDYC                       : 1; //Bit18
        volatile uint32_t HSERDYC                       : 1; //Bit19
        volatile uint32_t PLLRDYC                       : 1; //Bit20
        volatile uint32_t PLL2RDYC                      : 1; //Bit21
        volatile uint32_t PLL3RDYC                      : 1; //Bit22
        volatile uint32_t CSSC                          : 1; //Bit23
        volatile uint32_t Resv16_31                     : 8; //Bit24 ~ Bit31
    };

    typedef struct RCC_CIR_Struct RCC_CIR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! AHB外设时钟复位寄存器(RCC_AHBRSTR)
    struct RCC_AHBRSTR_Struct
    {
        volatile uint32_t Resv1                         : 12; //Bit0 ~ Bit11
        volatile uint32_t OTGFSRST                      : 1; //Bit12
        volatile uint32_t Resv2                         : 1; //Bit13
        volatile uint32_t ETHMACRST                     : 1; //Bit14
        volatile uint32_t Resv3                         : 1; //Bit15
        volatile uint32_t Resv16_31                     : 16; //Bit16 ~ Bit31
    };

    typedef struct RCC_AHBRSTR_Struct RCC_AHBRSTR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! APB2外设复位寄存器(RCC_APB2RSTR)
    struct RCC_APB2RSTR_Struct
    {
        volatile uint32_t AFIORST                       : 1; //Bit0
        volatile uint32_t Resv1                         : 1; //Bit1
        volatile uint32_t IOPARST                       : 1; //Bit2
        volatile uint32_t IOPBRST                       : 1; //Bit3
        volatile uint32_t IOPCRST                       : 1; //Bit4
        volatile uint32_t IOPDRST                       : 1; //Bit5
        volatile uint32_t IOPERST                       : 1; //Bit6
        volatile uint32_t Resv2                         : 2; //Bit7 ~ bIT8
        volatile uint32_t ADC1RST                       : 1; //Bit9
        volatile uint32_t ADC2RST                       : 1; //Bit10
        volatile uint32_t TIM1RST                       : 1; //Bit11
        volatile uint32_t SPI1RST                       : 1; //Bit12
        volatile uint32_t Resv3                         : 1; //Bit13
        volatile uint32_t USART1RST                     : 1; //Bit14
        volatile uint32_t Resv4                         : 1; //Bit15
        volatile uint32_t Resv16_31                     : 16; //Bit16 ~ Bit31
    };

    typedef struct RCC_APB2RSTR_Struct RCC_APB2RSTR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! APB1外设复位寄存器(RCC_APB1RSTR)
    struct RCC_APB1RSTR_Struct
    {
        volatile uint32_t TIM2RST                       : 1; //Bit0
        volatile uint32_t TIM3RST                       : 1; //Bit1
        volatile uint32_t TIM4RST                       : 1; //Bit2
        volatile uint32_t TIM5RST                       : 1; //Bit3
        volatile uint32_t TIM6RST                       : 1; //Bit4
        volatile uint32_t TIM7RST                       : 1; //Bit5
        volatile uint32_t Resv1                         : 5; //Bit6 ~ Bit10
        volatile uint32_t WWDGRST                       : 1; //Bit11
        volatile uint32_t Resv2                         : 2; //Bit12 ~ Bit13
        volatile uint32_t SPI2RST                       : 1; //Bit14
        volatile uint32_t SPI3RST                       : 1; //Bit15
        volatile uint32_t Resv3                         : 1; //Bit16
        volatile uint32_t USART2RST                     : 1; //Bit17
        volatile uint32_t USART3RST                     : 1; //Bit18
        volatile uint32_t UART4RST                      : 1; //Bit19
        volatile uint32_t UART5RST                      : 1; //Bit20
        volatile uint32_t I2C1RST                       : 1; //Bit21
        volatile uint32_t I2C2RST                       : 1; //Bit22
        volatile uint32_t Resv4                         : 2; //Bit23 ~ Bit24
        volatile uint32_t CAN1RST                       : 1; //Bit25
        volatile uint32_t CAN2RST                       : 1; //Bit26
        volatile uint32_t BKPRST                        : 1; //Bit27
        volatile uint32_t PWRRST                        : 1; //Bit28
        volatile uint32_t DACRST                        : 1; //Bit29
        volatile uint32_t Resv5                         : 2; //Bit30 ~ Bit31
    };

    typedef struct RCC_APB1RSTR_Struct RCC_APB1RSTR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! AHB外设时钟使能寄存器(RCC_AHBENR)
    struct RCC_AHBENR_Struct
    {
        volatile uint32_t DMA1EN                        : 1; //Bit0
        volatile uint32_t DMA2EN                        : 1; //Bit1
        volatile uint32_t SRAMEN                        : 1; //Bit2
        volatile uint32_t Resv1                         : 1; //Bit3
        volatile uint32_t FLITFEN                       : 1; //Bit4
        volatile uint32_t Resv2                         : 1; //Bit5
        volatile uint32_t CRCEN                         : 1; //Bit6
        volatile uint32_t Resv3                         : 5; //Bit7 ~ Bit11
        volatile uint32_t OTGFSEN                       : 1; //Bit12
        volatile uint32_t Resv4                         : 1; //Bit13
        volatile uint32_t ETHMACEN                      : 1; //Bit14
        volatile uint32_t ETHMACTXEN                    : 1; //Bit15
        volatile uint32_t ETHMACRXEN                    : 1; //Bit16
        volatile uint32_t Resv17_31                     : 15; //Bit17 ~ Bit31
    };

    typedef struct RCC_AHBENR_Struct RCC_AHBENR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! APB2外设时钟使能寄存器(RCC_APB2ENR)
    struct RCC_APB2ENR_Struct
    {
        volatile uint32_t AFIOEN                        : 1; //Bit0
        volatile uint32_t Resv1                         : 1; //Bit1
        volatile uint32_t IOPAEN                        : 1; //Bit2
        volatile uint32_t IOPBEN                        : 1; //Bit3
        volatile uint32_t IOPCEN                        : 1; //Bit4
        volatile uint32_t IOPDEN                        : 1; //Bit5
        volatile uint32_t IOPEEN                        : 1; //Bit6
        volatile uint32_t Resv2                         : 2; //Bit7 ~ Bit8
        volatile uint32_t ADC1EN                        : 1; //Bit9
        volatile uint32_t ADC2EN                        : 1; //Bit10
        volatile uint32_t TIM1EN                        : 1; //Bit11
        volatile uint32_t SPI1EN                        : 1; //Bit12
        volatile uint32_t Resv3                         : 1; //Bit13
        volatile uint32_t USART1EN                      : 1; //Bit14
        volatile uint32_t Resv4                         : 1; //Bit15
        volatile uint32_t Resv16_31                     : 16; //Bit16 ~ Bit31
    };

