zhiyix/jlydemo/Code/Libraries/GSFLibraries/STM32F10x_GSFGLibC/inc/stm32glibc_rcc.h
    typedef struct RCC_APB2ENR_Struct RCC_APB2ENR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! APB1外设时钟使能寄存器(RCC_APB1ENR)
    struct RCC_APB1ENR_Struct
    {
        volatile uint32_t TIM2EN                        : 1; //Bit0
        volatile uint32_t TIM3EN                        : 1; //Bit1
        volatile uint32_t TIM4EN                        : 1; //Bit2
        volatile uint32_t TIM5EN                        : 1; //Bit3
        volatile uint32_t TIM6EN                        : 1; //Bit4
        volatile uint32_t TIM7EN                        : 1; //Bit5
        volatile uint32_t Resv1                         : 5; //Bit6 ~ Bit10
        volatile uint32_t WWDGEN                        : 1; //Bit11
        volatile uint32_t Resv2                         : 2; //Bit12 ~ Bit13
        volatile uint32_t SPI2EN                        : 1; //Bit14
        volatile uint32_t SPI3EN                        : 1; //Bit15
        volatile uint32_t Resv3                         : 1; //Bit16
        volatile uint32_t USART2EN                      : 1; //Bit17
        volatile uint32_t USART3EN                      : 1; //Bit18
        volatile uint32_t UART4EN                       : 1; //Bit19
        volatile uint32_t UART5EN                       : 1; //Bit20
        volatile uint32_t I2C1EN                        : 1; //Bit21
        volatile uint32_t I2C2EN                        : 1; //Bit22
        volatile uint32_t Resv4                         : 2; //Bit23 ~ Bit24
        volatile uint32_t CAN1EN                        : 1; //Bit25
        volatile uint32_t CAN2EN                        : 1; //Bit26
        volatile uint32_t BKPEN                         : 1; //Bit27
        volatile uint32_t PWREN                         : 1; //Bit28
        volatile uint32_t DACEN                         : 1; //Bit29
        volatile uint32_t Resv5                         : 2; //Bit30 ~ Bit31
    };

    typedef struct RCC_APB1ENR_Struct RCC_APB1ENR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! 备份域控制寄存器(RCC_BDCR)
    struct RCC_BDCR_Struct
    {
        volatile uint32_t LSEON                         : 1; //Bit0
        volatile uint32_t LSERDY                        : 1; //Bit1
        volatile uint32_t LSEBYP                        : 1; //Bit2
        volatile uint32_t Resv1                         : 5; //Bit3 ~ Bit7
        volatile uint32_t RTCSEL                        : 2; //Bit8 ~ Bit9
        volatile uint32_t Resv2                         : 5; //Bit10 ~ Bit14
        volatile uint32_t RTCEN                         : 1; //Bit15
        volatile uint32_t BDRST                         : 1; //Bit16
        volatile uint32_t Resv17_31                     : 15; //Bit17 ~ Bit31
    };

    typedef struct RCC_BDCR_Struct RCC_BDCR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! 状态控制寄存器(RCC_CSR)
    struct RCC_CSR_Struct
    {
        volatile uint32_t LSION                         : 1; //Bit0
        volatile uint32_t LSIRDY                        : 1; //Bit1
        volatile uint32_t Resv1                         : 14; //Bit2 ~ Bit15
        volatile uint32_t Resv2                         : 8; //Bit16 ~ Bit23
        volatile uint32_t RMVF                          : 1; //Bit24
        volatile uint32_t Resv3                         : 1; //Bit25
        volatile uint32_t PINRSTF                       : 1; //Bit26
        volatile uint32_t PORRSTF                       : 1; //Bit27
        volatile uint32_t SFTRSTF                       : 1; //Bit28
        volatile uint32_t IWDGRSTF                      : 1; //Bit29
        volatile uint32_t WWDGRSTF                      : 1; //Bit30
        volatile uint32_t LPWRRSTF                      : 1; //Bit31
    };

    typedef struct RCC_CSR_Struct RCC_CSR_Typedef;

    /**************** Generate by STM32 StdPeriph v3.5 ****************/
    /****************           program by Wang Zhiyix ****************/
    //! 时钟配置寄存器(RCC_CFGR2)
    struct RCC_CFGR2_Struct
    {
        volatile uint32_t PREDIV1                       : 4; //Bit0 ~ Bit3
        volatile uint32_t PREDIV2                       : 4; //Bit4 ~ Bit7
        volatile uint32_t PLL2MUL                       : 4; //Bit8 ~ Bit11
        volatile uint32_t PLL3MUL                       : 4; //Bit12 ~ Bit15
        volatile uint32_t PREDIVSRC                     : 1; //Bit16
        volatile uint32_t I2S2SRC                       : 1; //Bit17
        volatile uint32_t I2S3SRC                       : 1; //Bit18
        volatile uint32_t Resv19_31                     : 13; //Bit19 ~ Bit31
    };

    typedef struct RCC_CFGR2_Struct RCC_CFGR2_Typedef;

    //!
    //! @{
    typedef enum RCC_EXTOSC
    {
        RCC_EXTOSC_OFF              	= ((uint32_t)(0x00000000)),
        RCC_EXTOSC_ON                 	= ((uint32_t)(0x00000001 << 0)),
        RCC_EXTOSC_Bypass              	= ((uint32_t)(0x00000001 << 2)),
    } RCC_EXTOSC_Mode;

    //!
    //! @{
    typedef enum RCC_CLK
    {
        RCC_Source_Null              	= ((uint32_t)(0x00000000)),
        RCC_Source_HSI                 	= ((uint32_t)(0x00000001 << 1)),
        RCC_Source_LSE                 	= ((uint32_t)(0x00000001 << 2)),
        RCC_Source_LSI                 	= ((uint32_t)(0x00000001 << 3)),
        //!
        RCC_Source_SYSCLK              	= ((uint32_t)(0x00000001 << 8)),
        RCC_Source_HCLK              	= ((uint32_t)(0x00000001 << 9)),
        RCC_Source_APB1              	= ((uint32_t)(0x00000001 << 10)),
        RCC_Source_APB2              	= ((uint32_t)(0x00000001 << 11)),
        RCC_Source_RTCCLK           	= ((uint32_t)(0x00000001 << 12)),
        RCC_Source_ADCCLK              	= ((uint32_t)(0x00000001 << 14)),
        //!
        RCC_Source_HSE                 	= ((uint32_t)(0x00000001 << 16)),
        RCC_Source_PLL                 	= ((uint32_t)(0x00000001 << 24)),
        RCC_Source_PLL2                	= ((uint32_t)(0x00000001 << 26)),
        RCC_Source_PLL3                	= ((uint32_t)(0x00000001 << 28)),
    } RCC_Clock;

    typedef struct RCC_Struct
    {
        //下面的内容不要更改，尤其是变量的顺序！
        volatile uint32_t CR;
        volatile uint32_t CFGR;
        volatile uint32_t CIR;
        volatile uint32_t APB2RSTR;
        volatile uint32_t APB1RSTR;
        volatile uint32_t AHBENR;
        volatile uint32_t APB2ENR;
        volatile uint32_t APB1ENR;
        volatile uint32_t BDCR;
        volatile uint32_t CSR;

#ifdef STM32F10X_CL
        volatile uint32_t AHBRSTR;
        volatile uint32_t CFGR2;
#endif /* STM32F10X_CL */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
        uint32_t  RESERVED0;
        volatile uint32_t CFGR2;
#endif /* STM32F10X_LD_VL || STM32F10X_MD_VL || STM32F10X_HD_VL */
        //上面的内容不要更改，尤其是变量的顺序！
    public:
        void Config(uint32_t RCC_Source, uint32_t RCC_Mode);
        void PreConfig(uint32_t RCC_Source, uint32_t RCC_Prescaler);
        void PLLConfig(uint32_t RCC_PLLSource, uint32_t RCC_PLLMul);
        void MCOConfig(uint32_t RCC_MCO);

        void Cmd(uint32_t RCC_Source, uint8_t NewState);
        void AHBPeriphClockCmd(uint32_t RCC_Periph_Source, uint8_t NewState);
        void APB2PeriphClockCmd(uint32_t RCC_Periph_Source, uint8_t NewState);
        void APB1PeriphClockCmd(uint32_t RCC_Periph_Source, uint8_t NewState);
        void APB2PeriphResetCmd(uint32_t RCC_Periph_Source, uint8_t NewState);
        void APB1PeriphResetCmd(uint32_t RCC_Periph_Source, uint8_t NewState);

        ErrorStatus WaitForStartUp(uint32_t RCC_Source);
        void AdjustHSICalibrationValue(uint8_t HSICalibrationValue);
        uint8_t   GetSYSCLKSource(uint32_t RCC_Source = 0);
        void GetClocksFreq(RCC_ClocksTypeDef &RCC_Clocks);
    protected:
        RCC_Struct() {};
    } RCC_Typedef;
}
using periph_c::RCC_Typedef;

#define stRCC				((RCC_Typedef*)RCC_BASE)
#define CLOCK				(*stRCC)

#endif /* __STM32GLIBC_RCC_H */
/*******************************************************************************
**                                END OF FILE                                 **
*******************************************************************************/
